---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilteredElementIdIterator
source: html/e2c64374-a91c-da03-ac03-da4f8f3a88c4.htm
---
# FilteredElementIdIterator Properties

Gets the item at the current position of the iterator.